framework_tvb/tvb/tests/ui_tests/load_tests/src/test/jmeter/NavigateToDataStructureTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Navigate To Data Structure" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="1 user group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1345469548000</longProp>
        <longProp name="ThreadGroup.end_time">1345469548000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="Navigate to data structure - 1 user" enabled="true">
          <stringProp name="junitSampler.classname">org.tvb.tests.UserTest</stringProp>
          <stringProp name="junitsampler.method">testNavigateToDataStructure</stringProp>
          <stringProp name="junitsampler.success">Test successful - Navigate to data structure with 1 user</stringProp>
          <stringProp name="junitsampler.success.code">1000</stringProp>
          <stringProp name="junitsampler.failure">Test failed - Navigate to data structure with 1 user</stringProp>
          <stringProp name="junitsampler.failure.code">0001</stringProp>
          <stringProp name="junitsampler.error">An unexpected error occured - Navigate to data structure with 1 user</stringProp>
          <stringProp name="junitsampler.error.code">9999</stringProp>
          <stringProp name="junitsampler.exec.setup">false</stringProp>
          <stringProp name="junitsampler.append.error">false</stringProp>
          <stringProp name="junitsampler.append.exception">false</stringProp>
        </JUnitSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="3 concurrent users group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1345469600000</longProp>
        <longProp name="ThreadGroup.end_time">1345469600000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="Navigate to data structure - 3 concurrent users" enabled="true">
          <stringProp name="junitSampler.classname">org.tvb.tests.UserTest</stringProp>
          <stringProp name="junitsampler.method">testNavigateToDataStructure</stringProp>
          <stringProp name="junitsampler.success">Test successful - Navigate to data structure with 3 concurrent users</stringProp>
          <stringProp name="junitsampler.success.code">1001</stringProp>
          <stringProp name="junitsampler.failure">Test failed - Navigate to data structure with 3 concurrent users</stringProp>
          <stringProp name="junitsampler.failure.code">0002</stringProp>
          <stringProp name="junitsampler.error">An unexpected error occured - Navigate to data structure with 3 concurrent users</stringProp>
          <stringProp name="junitsampler.error.code">9998</stringProp>
          <stringProp name="junitsampler.exec.setup">false</stringProp>
          <stringProp name="junitsampler.append.error">false</stringProp>
          <stringProp name="junitsampler.append.exception">false</stringProp>
        </JUnitSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="10 concurrent users group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <longProp name="ThreadGroup.start_time">1345469600000</longProp>
        <longProp name="ThreadGroup.end_time">1345469600000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="Navigate to data structure - 10 concurrent users" enabled="true">
          <stringProp name="junitSampler.classname">org.tvb.tests.UserTest</stringProp>
          <stringProp name="junitsampler.method">testNavigateToDataStructure</stringProp>
          <stringProp name="junitsampler.success">Test successful - Navigate to data structure with 10 concurrent users</stringProp>
          <stringProp name="junitsampler.success.code">1001</stringProp>
          <stringProp name="junitsampler.failure">Test failed - Navigate to data structure with 10 concurrent users</stringProp>
          <stringProp name="junitsampler.failure.code">0002</stringProp>
          <stringProp name="junitsampler.error">An unexpected error occured - Navigate to data structure with 10 concurrent users</stringProp>
          <stringProp name="junitsampler.error.code">9998</stringProp>
          <stringProp name="junitsampler.exec.setup">false</stringProp>
          <stringProp name="junitsampler.append.error">false</stringProp>
          <stringProp name="junitsampler.append.exception">false</stringProp>
        </JUnitSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="15 concurrent users group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">15</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <longProp name="ThreadGroup.start_time">1345469632000</longProp>
        <longProp name="ThreadGroup.end_time">1345469632000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <JUnitSampler guiclass="JUnitTestSamplerGui" testclass="JUnitSampler" testname="Navigate to data structure - 15 concurrent users" enabled="true">
          <stringProp name="junitSampler.classname">org.tvb.tests.UserTest</stringProp>
          <stringProp name="junitsampler.method">testNavigateToDataStructure</stringProp>
          <stringProp name="junitsampler.success">Test successful - Navigate to data structure with 15 concurrent users</stringProp>
          <stringProp name="junitsampler.success.code">1002</stringProp>
          <stringProp name="junitsampler.failure">Test failed - Navigate to data structure with 15 concurrent users</stringProp>
          <stringProp name="junitsampler.failure.code">0003</stringProp>
          <stringProp name="junitsampler.error">An unexpected error occured - Navigate to data structure with 15 concurrent users</stringProp>
          <stringProp name="junitsampler.error.code">9997</stringProp>
          <stringProp name="junitsampler.exec.setup">false</stringProp>
          <stringProp name="junitsampler.append.error">false</stringProp>
          <stringProp name="junitsampler.append.exception">false</stringProp>
        </JUnitSampler>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>